app/views/student/admission1.html.erb

          <label for="student_grade"><%= t('course_and_batch') %></label>
          <div class="text-input-bg"><%= select :student, :batch_id, Batch.active.map {|b| [b.full_name, b.id]} %></div>
---
SELECT `students`.* FROM `students` ORDER BY `students`.`id` DESC LIMIT 1