app/views/reminder/index.erb

SELECT `reminders`.* FROM `reminders` WHERE (recipient = '1' and is_deleted_by_recipient = false) ORDER BY created_at DESC LIMIT 12 OFFSET 0
---
              <% unless sender_user.nil? %>
                <td class="col-4"><%= link_to "#{sender_user.first_name}", :controller=>"reminder", :action=>"view_reminder",:id2=>ur.id %></td>