app/views/user/dashboard.erb


        <% if permitted_to? :index, :student_attendance or  permitted_to? :index, :attendances and @employee_subjects.present? or @user.privileges.map{|p| p.name}.include?("StudentAttendanceView") or @user.privileges.map{|p| p.name}.include?("StudentAttendanceRegister") %>
---
SELECT `privileges`.* FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.`id` = `privileges_users`.`privilege_id` WHERE `privileges_users`.`user_id` = 1

      <% else %>
        <% @attendance_type = FedenaConfiguration.find_by_config_key('StudentAttendanceType') %>
---
SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'StudentAttendanceType' LIMIT 1