app/controllers/application_controller.rb

SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'Locale') LIMIT 1
---
  def set_user_language
    lan = FedenaConfiguration.find_by_config_key("Locale")