app/controllers/attendance_reports_controller.rb

  def index
    if current_user.admin?
      @batches = Batch.active
    elsif @current_user.privileges.map{|p| p.name}.include?('StudentAttendanceView')
      @batches = Batch.active
    elsif @current_user.employee?
      @batches=Batch.find_all_by_employee_id @current_user.employee_record.id
      @batches+=@current_user.employee_record.subjects.collect{|b| b.batch}
      @batches=@batches.uniq unless @batches.empty?
    end
    @config = FedenaConfiguration.find_by_config_key('StudentAttendanceType')
---
SELECT `privileges`.* FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.`id` = `privileges_users`.`privilege_id` WHERE `privileges_users`.`user_id` = 1
SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'AvailableModules'