app/controllers/attendances_controller.rb

SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'AvailableModules'
---
  def show
    @config = FedenaConfiguration.find_by_config_key('StudentAttendanceType')