app/controllers/employee_attendances_controller.rb

SELECT * FROM `employee_departments` WHERE (status = true) ORDER BY name ASC
---
  def index
    @departments = EmployeeDepartment.find(:all, :conditions=>"status = true", :order=> "name ASC")

SELECT * FROM `employee_departments` WHERE (`employee_departments`.`id` = 16)
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = 16)
---
  def show
    @dept = EmployeeDepartment.find(params[:dept_id])
    @employees = Employee.find_all_by_employee_department_id(@dept.id)

SELECT * FROM `employees` WHERE (`employees`.`id` = 32)
SELECT * FROM `employee_leave_types` WHERE (status = true) ORDER BY name ASC
---
  def new
    @attendance = EmployeeAttendance.new
    @employee = Employee.find(params[:id2])
    @date = params[:id]
    @leave_types = EmployeeLeaveType.find(:all, :conditions=>"status = true", :order=>"name ASC")