app/controllers/employee_controller.rb

SELECT `employee_categories`.* FROM `employee_categories` WHERE (status = 1) ORDER BY name asc
---
  def add_category
    @categories = EmployeeCategory.find(:all,:order => "name asc",:conditions=>'status = 1')