app/controllers/student_controller.rb

SELECT `sms_settings`.* FROM `sms_settings` WHERE `sms_settings`.`settings_key` = 'ApplicationEnabled' LIMIT 1
SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'AvailableModules'
SELECT `students`.* FROM `students` ORDER BY `students`.`id` DESC LIMIT 1
---
  def admission1
    @student = Student.new(params[:student])
    @selected_value = FedenaConfiguration.default_country
    @application_sms_enabled = SmsSetting.find_by_settings_key("ApplicationEnabled")
    @last_admitted_student = Student.find(:last)
    @config = FedenaConfiguration.find_by_config_key('AdmissionNumberAutoIncrement')
    @categories = StudentCategory.active
    if request.post?
      if @config.config_value.to_i == 1
        @exist = Student.find_by_admission_no(params[:student][:admission_no])
        if @exist.nil?
          @status = @student.save
        else
          @last_admitted_student = Student.find(:last)
          @student.admission_no = @last_admitted_student.admission_no.next
          @status = @student.save
        end
      else
        @status = @student.save
      end
      if @status
        sms_setting = SmsSetting.new()
        if sms_setting.application_sms_active and @student.is_sms_enabled
          recipients = []
          message = "#{t('student_admission_done')} #{@student.admission_no} #{t('password_is')} #{@student.admission_no}123"
          if sms_setting.student_admission_sms_active
            recipients.push @student.phone2 unless @student.phone2.blank?