app/controllers/timetable_controller.rb

SELECT `timetables`.* FROM `timetables` WHERE (end_date > '2013-09-16') ORDER BY start_date ASC
---
  def edit_master
    @courses = Batch.active
    @timetables=Timetable.find(:all,:conditions=>["end_date > ?",@local_tzone_time.to_date])