app/controllers/user_controller.rb

  def dashboard
    @user = current_user
    @config = FedenaConfiguration.available_modules
    @employee = @user.employee_record if ["#{t('admin')}","#{t('employee_text')}"].include?(@user.role_name)
    if @user.student?
      @student = Student.find_by_admission_no(@user.username)
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`user_id` = 1 ORDER BY `employees`.`id` ASC LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1

  def login
    @institute = FedenaConfiguration.find_by_config_key("LogoName")
    available_login_authes = FedenaPlugin::AVAILABLE_MODULES.select{|m| m[:name].classify.constantize.respond_to?("login_hook")}
    selected_login_hook = available_login_authes.first if available_login_authes.count >= 1
    if selected_login_hook
      authenticated_user = selected_login_hook[:name].classify.constantize.send("login_hook",self)
    else
      if request.post? and params[:user]
        @user = User.new(params[:user])
        user = User.active.find_by_username @user.username
---
SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'LogoName' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'admin' LIMIT 1

  def profile
    @config = FedenaConfiguration.available_modules
    @current_user = current_user
    @username = @current_user.username if session[:user_id]
    @user = User.active.find_by_username(params[:id])
    unless @user.nil?
      @employee = Employee.find_by_employee_number(@user.username)
      @student = Student.find_by_admission_no(@user.username)
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`employee_number` = 'admin' LIMIT 1
SELECT `students`.* FROM `students` WHERE `students`.`admission_no` = 'admin' LIMIT 1

  def header_link
    @user = current_user
    #@reminders = @users.check_reminders
    @config = FedenaConfiguration.available_modules
    @employee = Employee.find_by_employee_number(@user.username)
    @employee ||= Employee.first if current_user.admin?
    @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1