app/views/layouts/_main_menu.html.erb

    <% @employee_batches=Batch.find_all_by_employee_id(@employee.id) %>
    <% @attendance_type = FedenaConfiguration.find_by_config_key('StudentAttendanceType') %>
    <% if @attendance_type.config_value == 'Daily' %>
      <% if permitted_to? :index, :student_attendance or @employee_batches.present? or @current_user.privileges.map{|p| p.name}.include?("StudentAttendanceView") or @current_user.privileges.map{|p| p.name}.include?("StudentAttendanceRegister") %>
---
SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`config_key` = 'CCE' LIMIT 1
SELECT `privileges`.* FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.`id` = `privileges_users`.`privilege_id` WHERE `privileges_users`.`user_id` = 1